Tekla Open API Reference for Tekla Structures 2025
Reinforcement.Father Property
 Gets or sets the father object of the reinforcement; the model object instance to operate on.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModelObject Father { get; set; }
Public Property Father As ModelObject
	Get
	Set
Property Value
Type: ModelObject
See Also
Reference
Reinforcement Class
Tekla.Structures.Model Namespace